# modules/home/texts.py
from modules.i18n import t

def MAIN(lang: str) -> str:
    return f"🏠 <b>{t('home_title', lang)}</b>\n\n{t('home_body', lang)}"

def HELP(lang: str) -> str:
    return t("<b>📖 راهنمای استفاده از Vexa</b>\n\n"
            "<b>🔹 کردیت یعنی چی؟</b>\n"
            "هر حرف، فاصله یا علامت = ۱ کردیت\n\n"
            "<b>🔹 کردیت رایگان اولیه:</b>\n"
            "بعد از استارت، <b>۴۵ کردیت رایگان</b> داری\n"
            "یعنی می‌تونی یه جمله کوتاه تست کنی (مثل: «سلام، من Vexa هستم»)\n<b>⏳ ( هر 1000 کردیت = 1:20 دقیقـه محتوا )</b>\n\n"
            "<b>🔹 اگر پیام «موجودی کافی نیست» دیدی:</b>\n"
            "یعنی متن بلندتر از کردیت موجودته\n"
            "مثلاً متن تو ۸۰ کردیت نیاز داشته ولی موجودی فقط ۴۵ بوده\n"
            "✅ <b>راه‌حل:</b> متن کوتاه‌تر بفرست یا اعتبار بخری\n\n"
            "<b>️نکته مهم برای گرفتن بهترین صدا از Vexa</b>\n\n"
            "برای اینکه ویس طبیعی‌تر و حرفه‌ای‌تر باشه، حتماً موقع نوشتن متن از علامت‌گذاری استفاده کنید:\n"
            "    •  جمله‌هاتونو با نقطه (.) جدا کنید.\n"
            "    •  برای مکث کوتاه از ویرگول (،) استفاده کنید.\n"
            "    •  پرسش‌ها رو با علامت سؤال (؟) بنویسید.\n"
            "    •  برای هیجان می‌تونید از ! هم استفاده کنید.\n\n"
            "✍️ مثال:\n"
            "    •  ❌ «سلام خوبی امیدوارم حالت خوب باشه»\n"
            "    •  ✅ «سلام! خوبی؟ امیدوارم حالت خوب باشه.»\n"
        )
