# دکمه/عناوین
CREDIT_TITLE = "خرید کردیت"
CREDIT_HEADER = "برای استفاده از ربات، کردیت لازم دارید.\nیکی از بسته‌های زیر را انتخاب کنید:"
PAY_STARS_BTN = "خرید با ستاره ⭐️"
PAY_RIAL_BTN = "پرداخت به تومن 💵"
PAY_RIAL_TITLE = "پرداخت به تومـن – انتخاب پلن"
PAY_RIAL_PLANS_HEADER = "یکی از پلن‌های زیر را انتخاب کن:"
PAY_RIAL_INSTANT = "پرداخت فوری (کارت‌به‌کارت)"
BACK_BTN = "بازگشت 🔙"
CANCEL_BTN = "لغو ❌"

# متن‌ها
INSTANT_PAY_INSTRUCT = (
    "💱 <b>پرداخت فوری (کارت‌به‌کارت)</b>\n"
    "شماره کارت: <code>{card}</code>\n\n"
    "• مطابق یکی از قیمت‌ها کارت‌به‌کارت کن.\n"
    "• سپس <b>تصویر رسید</b> را همین‌جا ارسال کن.\n\n"
    "✅ پس از پرداخت، کردیت شما کمتر از ۵ دقیقه به حساب کاربری‌تون اضافه میشه\n"
)

WAITING_CONFIRM = "✅ رسید دریافت شد.\n⏳ لطفاً منتظر تایید ادمین باش."
